<html>
<head>
<title>Six Ways To Explore The Russian Twitter Trolls Database In Neo4j</title>
<link href="../Styles/Style.css" type="text/css" rel="stylesheet"/>
</head>
<body>
<h1 class="translated">在Neo4j中探索俄罗斯Twitter Trolls数据库的六种方法</h1>
<blockquote>原文：<a href="https://medium.com/hackernoon/six-ways-to-explore-the-russian-twitter-trolls-database-in-neo4j-6e52394c38f1?source=collection_archive---------9-----------------------#2018-02-14">https://medium.com/hackernoon/six-ways-to-explore-the-russian-twitter-trolls-database-in-neo4j-6e52394c38f1?source=collection_archive---------9-----------------------#2018-02-14</a></blockquote><div><div class="ef hi hj hk hl hm"/><div class="hn ho hp hq hr"><div class=""/><p id="9449" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">NBC新闻<a class="ae jp" href="https://www.nbcnews.com/tech/social-media/now-available-more-200-000-deleted-russian-troll-tweets-n844731" rel="noopener ugc nofollow" target="_blank">公开发布了一个已删除推文的数据库</a>，这些推文来自他们对俄罗斯推特流氓如何影响2016年美国大选的调查。你可以在他们的故事<a class="ae jp" href="https://www.nbcnews.com/tech/social-media/russian-trolls-pushed-graphic-racist-tweets-american-voters-n823001" rel="noopener ugc nofollow" target="_blank">这里</a>和<a class="ae jp" href="https://www.nbcnews.com/tech/social-media/russian-trolls-went-attack-during-key-election-moments-n827176" rel="noopener ugc nofollow" target="_blank">这里</a>中读到NBC的分析结果，但这篇文章的重点将是<strong class="it hv">你如何利用开源数据分析工具自己探索数据。</strong>我们将展示如何从数据入手，希望能启发你自己去挖掘数据。</p><h1 id="326f" class="jq jr hu bd js jt ju jv jw jx jy jz ka kb kc kd ke kf kg kh ki kj kk kl km kn dt translated">1.Neo4j沙盒和Neo4j浏览器</h1><p id="d913" class="pw-post-body-paragraph ir is hu it b iu ko iw ix iy kp ja jb jc kq je jf jg kr ji jj jk ks jm jn jo hn dt translated">NBC新闻已经将数据发布为Neo4j数据库和CSV文件，可以与您喜欢的数据分析工具一起使用。但是从数据开始最简单的方法是使用<a class="ae jp" href="http://neo4j.com/sandbox-v2/" rel="noopener ugc nofollow" target="_blank"> Neo4j沙箱</a>。Neo4j沙箱允许您创建一个预先填充了有趣数据集的Neo4j私有托管实例。</p><figure class="ku kv kw kx fq ky fe ff paragraph-image"><div role="button" tabindex="0" class="kz la di lb bf lc"><div class="fe ff kt"><img src="../Images/c29bb8cce27647f754e81b50402c9900.png" data-original-src="https://miro.medium.com/v2/resize:fit:1400/format:webp/1*6pT9LCOCDwf05MBrHJGhmQ.png"/></div></div><figcaption class="lf lg fg fe ff lh li bd b be z ek">Use <a class="ae jp" href="https://neo4j.com/sandbox-v2/" rel="noopener ugc nofollow" target="_blank">Neo4j Sandbox</a> to spin up private hosted Neo4j instances pre-populated with interesting datasets.</figcaption></figure><p id="5152" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">一旦您启动了您的俄罗斯Twitter Trolls沙盒实例，您将可以访问Neo4j浏览器，Neo4j的查询工作台将允许您与数据库进行交互。</p><figure class="ku kv kw kx fq ky fe ff paragraph-image"><div role="button" tabindex="0" class="kz la di lb bf lc"><div class="fe ff lj"><img src="../Images/5987a02a59efd3849634abc0b49cf1fb.png" data-original-src="https://miro.medium.com/v2/resize:fit:1400/format:webp/1*XrkVkRuunNJTziuwzW5zKA.png"/></div></div><figcaption class="lf lg fg fe ff lh li bd b be z ek">Use Neo4j Browser to visually explore the database.</figcaption></figure><h1 id="696d" class="jq jr hu bd js jt ju jv jw jx jy jz ka kb kc kd ke kf kg kh ki kj kk kl km kn dt translated">2.用密码查询</h1><p id="c785" class="pw-post-body-paragraph ir is hu it b iu ko iw ix iy kp ja jb jc kq je jf jg kr ji jj jk ks jm jn jo hn dt translated"><a class="ae jp" href="https://neo4j.com/cypher-graph-query-language/" rel="noopener ugc nofollow" target="_blank"> Cypher </a>，图形查询语言是一种探索数据库的好方法，可以在Neo4j浏览器中使用，或者通过使用Neo4j的<a class="ae jp" href="https://neo4j.com/developer/language-guides/" rel="noopener ugc nofollow" target="_blank">客户端驱动程序</a>构建应用程序来使用。</p><p id="c70b" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">Cypher使用<a class="ae jp" href="https://neo4j.com/developer/cypher-query-language/" rel="noopener ugc nofollow" target="_blank">图形模式匹配</a>来允许用户表达复杂的图形模式来匹配图形。这允许回答如下问题:</p><p id="fb71" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated"><strong class="it hv">巨魔最常用的标签是什么？</strong></p><pre class="ku kv kw kx fq lk ll lm ln aw lo dt"><span id="815d" class="lp jr hu ll b fv lq lr l ls lt">MATCH (t:Troll)-[:POSTED]-&gt;(tw:Tweet)-[:HAS_TAG]-&gt;(ht:Hashtag)<br/>RETURN ht.tag, COUNT(tw) AS num<br/>ORDER BY num DESC</span></pre><p id="3861" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated"><strong class="it hv">哪些巨魔账号的关注者最多？</strong></p><pre class="ku kv kw kx fq lk ll lm ln aw lo dt"><span id="2981" class="lp jr hu ll b fv lq lr l ls lt">MATCH (u:Troll) WHERE EXISTS(u.followers_count)<br/>RETURN u.screen_name AS screen_name, u.followers_count AS followers<br/>ORDER BY followers DESC LIMIT 50</span></pre><p id="7e76" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated"><strong class="it hv">哪些推文中含有“诈骗”二字？</strong></p><pre class="ku kv kw kx fq lk ll lm ln aw lo dt"><span id="c460" class="lp jr hu ll b fv lq lr l ls lt">MATCH (t:Troll)-[:POSTED]-&gt;(tw:Tweet)<br/>WHERE tw.text CONTAINS "fraud"<br/>OPTIONAL MATCH p=(tw)-[:HAS_TAG|HAS_LINK|MENTIONS|IN_REPLY_TO]-(a)<br/>RETURN * LIMIT 50</span></pre><p id="cf59" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">找到推断的关系——哪些巨魔在转发其他巨魔？</p><pre class="ku kv kw kx fq lk ll lm ln aw lo dt"><span id="f697" class="lp jr hu ll b fv lq lr l ls lt">MATCH p=<br/>(:Troll)-[:POSTED]-&gt;(:Tweet)&lt;-[:RETWEETED]-(:Tweet)&lt;-[:POSTED]-(:Troll)<br/>RETURN p LIMIT 10</span></pre><p id="79a0" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated"><strong class="it hv">进一步的查询思路:</strong></p><ul class=""><li id="0e34" class="lu lv hu it b iu iv iy iz jc lw jg lx jk ly jo lz ma mb mc dt translated">巨魔发布推文最常用的应用是什么？</li><li id="0b85" class="lu lv hu it b iu md iy me jc mf jg mg jk mh jo lz ma mb mc dt translated">巨魔帐户在他们的个人资料中列出了哪些位置？</li><li id="d30d" class="lu lv hu it b iu md iy me jc mf jg mg jk mh jo lz ma mb mc dt translated">不是来自其他俄罗斯巨魔账户的哪些推文被转发的次数最多？</li></ul><h1 id="2669" class="jq jr hu bd js jt ju jv jw jx jy jz ka kb kc kd ke kf kg kh ki kj kk kl km kn dt translated">3.填写缺失的数据</h1><p id="7633" class="pw-post-body-paragraph ir is hu it b iu ko iw ix iy kp ja jb jc kq je jf jg kr ji jj jk ks jm jn jo hn dt translated">由于数据收集的方式不同，有些缺失。例如，一些用户缺少个人资料信息，一些推文缺少元数据，如赞数和转发数。</p><p id="4ef7" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated"><strong class="it hv">缺少个人资料信息</strong></p><p id="6a07" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">例如，用户“@TEN_GOP”在数据库中缺少个人资料信息，因为这不是采集到的:</p><pre class="ku kv kw kx fq lk ll lm ln aw lo dt"><span id="870f" class="lp jr hu ll b fv lq lr l ls lt">MATCH (u:Troll) WHERE u.screen_name = "TEN_GOP"<br/>RETURN u.id, u.screen_name, u.description, u.location, u.name<br/>-------------------------------------------------------------<br/>╒════════════╤═══════════════╤═══════════════╤════════════╤════════╕<br/>│"u.id"      │"u.screen_name"│"u.description"│"u.location"│"u.name"│<br/>╞════════════╪═══════════════╪═══════════════╪════════════╪════════╡<br/>│"4224729994"│"TEN_GOP"      │""             │""          │""      │<br/>└────────────┴───────────────┴───────────────┴────────────┴────────┘</span></pre><p id="b094" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">我们可以重建“@TEN_GOP”的Twitter个人资料URL:</p><pre class="ku kv kw kx fq lk ll lm ln aw lo dt"><span id="49c0" class="lp jr hu ll b fv lq lr l ls lt">https://twitter.com/TEN_GOP</span></pre><p id="a95b" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">但是因为这些账号已经被Twitter暂停了，所以我们看到的都是:</p><figure class="ku kv kw kx fq ky fe ff paragraph-image"><div role="button" tabindex="0" class="kz la di lb bf lc"><div class="fe ff mi"><img src="../Images/1eabe27227304acde1788eca5f1984d5.png" data-original-src="https://miro.medium.com/v2/resize:fit:1400/format:webp/1*zQqvozMK2tqXUC2WTLpjrA.png"/></div></div><figcaption class="lf lg fg fe ff lh li bd b be z ek">The Russian Troll accounts were suspended by Twitter, removing their data from Twitter.com and Twitter’s API</figcaption></figure><p id="c98f" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">我们可以检查网络缓存，如互联网档案，以找到这些网页的缓存版本，然后我们可能能够抓取。Internet Archive有一个API，用于检查页面的缓存版本，例如:</p><pre class="ku kv kw kx fq lk ll lm ln aw lo dt"><span id="9c53" class="lp jr hu ll b fv lq lr l ls lt"><a class="ae jp" href="http://archive.org/wayback/available?url=http://twitter.com/TEN_GOP" rel="noopener ugc nofollow" target="_blank">http://archive.org/wayback/available?url=http://twitter.com/TEN_GOP</a><br/>--------------------------------------------------------------------</span><span id="98a4" class="lp jr hu ll b fv mj lr l ls lt">{ <strong class="ll hv">url</strong>: "<a class="ae jp" href="http://twitter.com/TEN_GOP" rel="noopener ugc nofollow" target="_blank">http://twitter.com/TEN_GOP</a>",<br/>  <strong class="ll hv">archived_snapshots</strong>: {<br/>    <strong class="ll hv">closest</strong>: {<br/>      <strong class="ll hv">status</strong>: "200",<br/>      <strong class="ll hv">available</strong>: true,<br/>      <strong class="ll hv">url</strong>: "<a class="ae jp" href="http://web.archive.org/web/20170818065026/https://twitter.com/TEN_GOP" rel="noopener ugc nofollow" target="_blank">http://web.archive.org/web/20170818065026/https://twitter.com/TEN_GOP</a>",<br/>      <strong class="ll hv">timestamp</strong>: "20170818065026"<br/>    }<br/>  }<br/>}</span></pre><p id="6d06" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">显示“@TEN_GOP”的个人资料页面已被互联网存档捕获，并且在此处<a class="ae jp" href="http://web.archive.org/web/20170818065026/https://twitter.com/TEN_GOP" rel="noopener ugc nofollow" target="_blank">可用</a>。</p><p id="7333" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated"><strong class="it hv">丢失推文信息</strong></p><p id="ace6" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">我们还可以<strong class="it hv">为数据库中缺失信息的推文重建推文URL</strong>,以对照缓存进行检查:</p><pre class="ku kv kw kx fq lk ll lm ln aw lo dt"><span id="25da" class="lp jr hu ll b fv lq lr l ls lt">MATCH (u:Troll)-[:POSTED]-&gt;(t:Tweet) WHERE t.text = ""<br/>RETURN "<a class="ae jp" href="https://twitter.com/" rel="noopener ugc nofollow" target="_blank">https://twitter.com/</a>" + u.screen_name + "/status/" + t.id <br/>AS tweet_url <br/>LIMIT 10<br/>------------------------------------------------------------------<br/>╒═══════════════════════════════════════════════════════════╕<br/>│"tweet_url"                                                │<br/>╞═══════════════════════════════════════════════════════════╡<br/>│"https://twitter.com/SCOTTGOHARD/status/781651098398494720"│<br/>├───────────────────────────────────────────────────────────┤<br/>│"https://twitter.com/SCOTTGOHARD/status/780602260401299456"│<br/>├───────────────────────────────────────────────────────────┤<br/>│"https://twitter.com/WarfareWW/status/783649582064467968"  │<br/>├───────────────────────────────────────────────────────────┤<br/>│"https://twitter.com/WarfareWW/status/783642593137754114"  │<br/>├───────────────────────────────────────────────────────────┤<br/>│"https://twitter.com/WarfareWW/status/756033388423897088"  │<br/>├───────────────────────────────────────────────────────────┤<br/>│"https://twitter.com/WarfareWW/status/794918302585909250"  │<br/>├───────────────────────────────────────────────────────────┤<br/>│"https://twitter.com/WarfareWW/status/787416487346708481"  │<br/>├───────────────────────────────────────────────────────────┤<br/>│"https://twitter.com/WarfareWW/status/794189517653680132"  │<br/>├───────────────────────────────────────────────────────────┤<br/>│"https://twitter.com/WarfareWW/status/797080157135761409"  │<br/>├───────────────────────────────────────────────────────────┤<br/>│"https://twitter.com/WarfareWW/status/781515670379003904"  │<br/>└───────────────────────────────────────────────────────────┘</span></pre><p id="b9ef" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated"><strong class="it hv">展开网址</strong></p><p id="2918" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">许多推文包含使用link shortener服务的URL，因此不清楚他们实际上共享了哪些页面:</p><pre class="ku kv kw kx fq lk ll lm ln aw lo dt"><span id="e213" class="lp jr hu ll b fv lq lr l ls lt">MATCH (t:Troll)-[:POSTED]-&gt;(tw:Tweet)-[:HAS_LINK]-&gt;(u:URL)<br/>WHERE u.expanded_url CONTAINS "bit.ly"<br/>RETURN u.expanded_url LIMIT 10<br/>------------------------------------------------------------<br/>╒═══════════════════════╕<br/>│"u.expanded_url"       │<br/>╞═══════════════════════╡<br/>│"http://bit.ly/2eeMnZR"│<br/>├───────────────────────┤<br/>│"http://bit.ly/2dCn9qP"│<br/>├───────────────────────┤<br/>│"http://bit.ly/2ctTjGN"│<br/>├───────────────────────┤<br/>│"http://bit.ly/2eAOBnf"│<br/>├───────────────────────┤<br/>│"http://bit.ly/2awlrUs"│<br/>├───────────────────────┤<br/>│"http://bit.ly/2aAtdyN"│<br/>├───────────────────────┤<br/>│"http://bit.ly/29UHsyx"│<br/>├───────────────────────┤<br/>│"http://bit.ly/2cOskmM"│<br/>├───────────────────────┤<br/>│"http://bit.ly/2cOskmM"│<br/>├───────────────────────┤<br/>│"http://bit.ly/2cOskmM"│<br/>└───────────────────────┘</span></pre><p id="b307" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">我们可以使用cURL这样的工具来展开链接，找到最终的目的地URL:</p><pre class="ku kv kw kx fq lk ll lm ln aw lo dt"><span id="c6a0" class="lp jr hu ll b fv lq lr l ls lt">➜ curl -Ls -w %{url_effective} -o /dev/null <a class="ae jp" href="http://bit.ly/2eeMnZR" rel="noopener ugc nofollow" target="_blank">http://bit.ly/2eeMnZR</a></span><span id="6827" class="lp jr hu ll b fv mj lr l ls lt"><a class="ae jp" href="http://ksnt.com/2016/10/27/early-voting-more-good-signs-for-clinton-in-key-states/?utm_source=twitterfeed&amp;utm_medium=twitter%" rel="noopener ugc nofollow" target="_blank">http://ksnt.com/2016/10/27/early-voting-more-good-signs-for-clinton-in-key-states/?utm_source=twitterfeed&amp;utm_medium=twitter%</a></span></pre><p id="1ee8" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">像<a class="ae jp" href="https://unfurlr.com/" rel="noopener ugc nofollow" target="_blank">unfurler</a>这样的在线工具允许我们完成同样的事情，但也可以检查页面内容和欺骗用户代理。</p><p id="5cc2" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated"><strong class="it hv">丰富数据的进一步想法:</strong></p><ul class=""><li id="61b8" class="lu lv hu it b iu iv iy iz jc lw jg lx jk ly jo lz ma mb mc dt translated">用<a class="ae jp" href="https://github.com/neo4j-contrib/trumpworld-graph/tree/master/08-google-knowledge-graph" rel="noopener ugc nofollow" target="_blank">谷歌知识图</a>补充数据</li><li id="8170" class="lu lv hu it b iu md iy me jc mf jg mg jk mh jo lz ma mb mc dt translated">检查像<a class="ae jp" href="http://archive.is/" rel="noopener ugc nofollow" target="_blank"> archive.is </a>和<a class="ae jp" href="https://archive.org/" rel="noopener ugc nofollow" target="_blank"> Internet Archive </a>这样的网络缓存，寻找被删除推文的缓存版本</li><li id="1055" class="lu lv hu it b iu md iy me jc mf jg mg jk mh jo lz ma mb mc dt translated">在其他社交媒体平台上搜索被重复使用的用户名</li></ul><h1 id="3d55" class="jq jr hu bd js jt ju jv jw jx jy jz ka kb kc kd ke kf kg kh ki kj kk kl km kn dt translated">4.图形算法</h1><p id="eec4" class="pw-post-body-paragraph ir is hu it b iu ko iw ix iy kp ja jb jc kq je jf jg kr ji jj jk ks jm jn jo hn dt translated"><a class="ae jp" href="https://neo4j.com/graph-analytics/" rel="noopener ugc nofollow" target="_blank">图形算法</a>是一种将分析应用于整个图形的方法，以进一步增强我们对数据的理解。这些算法分为三类:</p><ul class=""><li id="c587" class="lu lv hu it b iu iv iy iz jc lw jg lx jk ly jo lz ma mb mc dt translated"><strong class="it hv">中心性</strong> —网络中最重要的节点是什么。中心性算法包括PageRank、中间中心性和接近中心性。</li><li id="d8a0" class="lu lv hu it b iu md iy me jc mf jg mg jk mh jo lz ma mb mc dt translated"><strong class="it hv">社区检测</strong> —图怎么分？社区检测和聚类算法包括Union Find、Louvain、标签传播和连接组件。</li><li id="4576" class="lu lv hu it b iu md iy me jc mf jg mg jk mh jo lz ma mb mc dt translated"><strong class="it hv">寻路</strong> —给定成本，最短路径或最佳路线是什么？寻路算法包括最小重量生成树、所有对和单源最短路径以及Dijkstra。</li></ul><figure class="ku kv kw kx fq ky fe ff paragraph-image"><div role="button" tabindex="0" class="kz la di lb bf lc"><div class="fe ff mk"><img src="../Images/6273dfd2dfd47a85b583c9bd645ec736.png" data-original-src="https://miro.medium.com/v2/resize:fit:1400/format:webp/1*tSl54ETRxS8GwRL6WD4pbA.png"/></div></div><figcaption class="lf lg fg fe ff lh li bd b be z ek">PageRank is a recursive graph algorithm that defines the importance of a node proportional to the importance and number of connected nodes in the graph. <a class="ae jp" href="https://en.wikipedia.org/wiki/PageRank" rel="noopener ugc nofollow" target="_blank">Image source Wikipedia</a></figcaption></figure><p id="e637" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">我们可以使用<a class="ae jp" href="https://github.com/neo4j-contrib/neo4j-graph-algorithms" rel="noopener ugc nofollow" target="_blank"> Neo4j图形算法</a>程序在Neo4j和Cypher中运行这些算法。例如，下面是如何在Troll转发图上运行PageRank:</p><pre class="ku kv kw kx fq lk ll lm ln aw lo dt"><span id="e242" class="lp jr hu ll b fv lq lr l ls lt">CALL algo.pageRank("MATCH (t:Troll) RETURN id(t) AS id",<br/> "MATCH (r1:Troll)-[:POSTED]-&gt;(:Tweet)&lt;-[:RETWEETED]-(:Tweet)&lt;-[:POSTED]-(r2:Troll) RETURN id(r2) as source, id(r1) as target", {graph:'cypher'})</span></pre><p id="4f07" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">有关在俄罗斯Troll数据集上运行图形算法的更多示例，请参见<a class="ae jp" href="https://neo4j.com/sandbox-v2/" rel="noopener ugc nofollow" target="_blank">俄罗斯Twitter Trolls Neo4j沙盒实例</a>的Neo4j浏览器指南。</p><p id="70c0" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated"><strong class="it hv">图形算法思路:</strong></p><ul class=""><li id="ea70" class="lu lv hu it b iu iv iy iz jc lw jg lx jk ly jo lz ma mb mc dt translated">最有影响力的巨魔账号有哪些？</li><li id="ced2" class="lu lv hu it b iu md iy me jc mf jg mg jk mh jo lz ma mb mc dt translated">你能使用社区检测算法根据交互在图中找到社区吗？</li></ul><h1 id="d5b5" class="jq jr hu bd js jt ju jv jw jx jy jz ka kb kc kd ke kf kg kh ki kj kk kl km kn dt translated">5.图形可视化</h1><p id="f277" class="pw-post-body-paragraph ir is hu it b iu ko iw ix iy kp ja jb jc kq je jf jg kr ji jj jk ks jm jn jo hn dt translated">数据可视化通常是理解图形算法结果的最佳方式。有许多用于可视化图形数据的开源工具，每种工具都有各自的优缺点。诸如<a class="ae jp" href="https://gephi.org/" rel="noopener ugc nofollow" target="_blank"> Gephi </a>、<a class="ae jp" href="http://visjs.org/network_examples.html" rel="noopener ugc nofollow" target="_blank"> vis.js </a>和<a class="ae jp" href="https://emeeks.github.io/semiotic/#/semiotic/networkframe" rel="noopener ugc nofollow" target="_blank">symbolic</a>等工具通常用于构建交互式图形可视化。</p><p id="3aef" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">对于那些熟悉数据可视化的人来说，图形数据带来了一系列独特的挑战。通常，图形可视化最重要的特征是:</p><ul class=""><li id="d9b0" class="lu lv hu it b iu iv iy iz jc lw jg lx jk ly jo lz ma mb mc dt translated">将<strong class="it hv">节点大小</strong>绑定到图中节点的重要性或中心性</li><li id="1980" class="lu lv hu it b iu md iy me jc mf jg mg jk mh jo lz ma mb mc dt translated">将节点分组到集群中。许多图形可视化工具使用强制定向布局来显示集群，但是我们也可以使用社区检测算法和<strong class="it hv">将社区绑定到节点颜色</strong>来显示集群</li><li id="608a" class="lu lv hu it b iu md iy me jc mf jg mg jk mh jo lz ma mb mc dt translated">显示<strong class="it hv">关系厚度</strong>与关系的属性或权重成比例</li></ul><figure class="ku kv kw kx fq ky fe ff paragraph-image"><div role="button" tabindex="0" class="kz la di lb bf lc"><div class="fe ff ml"><img src="../Images/8bb077eadd55756e5f867cf9fea07f00.png" data-original-src="https://miro.medium.com/v2/resize:fit:1400/format:webp/1*cjdhjOmXRAY7dvD08bY_kA.png"/></div></div><figcaption class="lf lg fg fe ff lh li bd b be z ek">Visualizing the Russian Troll retweet/reply network. Node size is proportional to PageRank, color shows the result of a community detection algorithm, and relationship thickness is determined by the number of retweets between the Trolls.</figcaption></figure><p id="af0d" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">上图显示了在俄罗斯巨魔转发图上运行<strong class="it hv"> PageRank </strong>和<strong class="it hv">社区检测算法</strong>的结果，并使用名为<a class="ae jp" href="http://github.com/johnymontana/neovis.js" rel="noopener ugc nofollow" target="_blank"> neovis.js </a>的vis.js包装器库进行可视化。</p><p id="57a2" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated"><strong class="it hv">进一步的想法:</strong></p><p id="7bbd" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">你能想象可以从图中提取的其他类型的推断网络吗？你如何用密码来表达这些图表？你能使用上面提到的工具之一来构建一个交互式图形可视化吗？</p><h1 id="2a57" class="jq jr hu bd js jt ju jv jw jx jy jz ka kb kc kd ke kf kg kh ki kj kk kl km kn dt translated">6.自然语言处理</h1><p id="83a6" class="pw-post-body-paragraph ir is hu it b iu ko iw ix iy kp ja jb jc kq je jf jg kr ji jj jk ks jm jn jo hn dt translated">自然语言处理(NLP)是理解文本数据的过程。常见的自然语言处理任务包括词性标注、实体提取、词语相似度和情感分析。有许多用于执行NLP任务的开源工具，如斯坦福的CoreNLP工具、Python中的<a class="ae jp" href="http://www.nltk.org/" rel="noopener ugc nofollow" target="_blank">NLTK</a>，甚至还有一些专门为处理Twitter数据而设计的工具，如<a class="ae jp" href="https://github.com/brendano/ark-tweet-nlp" rel="noopener ugc nofollow" target="_blank"> CMU的Twitter词性标记器</a>和一个用于查找hashtag定义的众包工具<a class="ae jp" href="https://tagdef.com/en/tag/en" rel="noopener ugc nofollow" target="_blank">。</a></p><figure class="ku kv kw kx fq ky fe ff paragraph-image"><div role="button" tabindex="0" class="kz la di lb bf lc"><div class="fe ff mm"><img src="../Images/1920e6eb633f1a92d4addbcb47d3ad76.png" data-original-src="https://miro.medium.com/v2/resize:fit:1400/format:webp/1*aRzIBLJP110pMMrgWHckqg.png"/></div></div><figcaption class="lf lg fg fe ff lh li bd b be z ek">Entity extraction on the Tweet data involves extending the graph model by annotating tweets that contain entities.</figcaption></figure><p id="aa1d" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">您甚至可以使用扩展在Neo4j中直接使用Cypher运行NLP任务。关于如何开始使用<a class="ae jp" href="https://github.com/graphaware/neo4j-nlp" rel="noopener ugc nofollow" target="_blank"> GraphAware neo4j-nlp程序</a>，请参见<a class="ae jp" rel="noopener" href="/@david.allen_3172/using-nlp-in-neo4j-ac40bc92196f">这篇文章</a>。对于那些熟悉使用Python工具进行NLP的人来说，这篇博文展示了如何使用Neo4j和Python对Twitter数据进行实体提取。</p><p id="6597" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated"><strong class="it hv">自然语言处理理念:</strong></p><ul class=""><li id="72ab" class="lu lv hu it b iu iv iy iz jc lw jg lx jk ly jo lz ma mb mc dt translated"><strong class="it hv">实体提取</strong> —推文中提到最多的人、组织、地点是什么？某些巨魔团体是在谈论某些实体吗？</li><li id="da8d" class="lu lv hu it b iu md iy me jc mf jg mg jk mh jo lz ma mb mc dt translated"><strong class="it hv">情绪分析</strong>——巨魔们在积极谈论什么吗？还是他们只专注于传播负面情绪？</li></ul><p id="015d" class="pw-post-body-paragraph ir is hu it b iu iv iw ix iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn jo hn dt translated">我们希望你对探索这些数据感到兴奋，在Twitter“@ neo4j”上与我们分享你发现的任何有趣的东西。</p></div></div>    
</body>
</html>